export default {
	arr:[
	{
	  title:'如何挖矿?',
	  content:'只要购买我们的产品，就能立即开始您的轻松挖矿之旅。请查看'
	 },
	 {
	  title:'产品何时生效，如何查看收益？',
	  content:'每批产品都会在产品详情中注明产品挖矿收益起算时间，请查阅产品详情说明。收益查看：在平台开放注册后，您只需要登录用户中心，点击“我的资产”即可看到您所拥有的BTC数量'
	 },
	{
	  title:'如何提取收益？',
	  content:'当您的BTC资产≥0.01时，您可以后台添加您的个人BTC钱包地址，输入您想提取的BTC数量，点击申请提币，即可将您所需要的BTC提取到您的私人钱包地址。该地址可以是全球任何地方任何人的BTC地址。龙算力平台只对您的申请负责，不会核实BTC地址的身份，提币操作您需要承担一定的手续费，会从您的提币数量中扣除，默认手续费为全网最低价。'
	 },
	 {
	  title:'什么是钱包地址，钱包地址有什么用？',
	  content:'比特币钱包地址是一个由数字和字母组成的字符串，是您在BTC世界的身份标识，如果把比特币交易比作一张支票，那么比特币地址就是收款人，当然您也可以拥有多个BTC钱包地址，但是请务必牢记您的密码。'
	 },
	 {
	  title:'如何获取钱包地址？',
	  content:'如果您没有钱包地址，请扫描下方二维码或点击下方链接注册您的专属钱包地址。'
	 },
	 {
	  title:'确认支付后，如何申请退款？',
	  content:'“BTC 5801、BTC 5802、BTC 6801”产品有效期为两年，一经售出，将不接受任何形式的退款要求，请在购买前，仔细确认价格信息。若产品期内发生连续10日实际收益为0，或发生包括不限于地震、台风、水灾、火灾等自然原因和战争、动乱、政府禁令等不可抗力情况，深圳射手座信息技术有限公司将有权终止产品，并不做任何形式赔偿。'
	 }

	]
}
