<template>
	<div class="agreement">
		<div class="w">
			<p class="title">云计算服务协议</p>
			甲方：
			
			深圳射手座信息技术有限公司
			&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
			统一社会信用代码：91440300MA5F10T77F 
			<br />
			联系地址：深圳市南山区南头街道深南大道10128号南山软件园东塔楼805室
			<br />
			乙方：
			<br />
			统一社会信用代码/身份证号：370829199304294230 
			<br />
			联系电话：13436514340 
			&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
			电子邮件：1757434067@qq.com 
			<br />
			鉴于： 
			<br />
			1、甲方具有丰富的行业资源，是专业的云计算服务提供商，有意为乙方提供云计算服务（以下简称“服务”），以满足乙方的业务、经营需求； 
			<br />
			2、乙方认可甲方的产品及专业服务能力，有意购买甲方提供的服务，以从事其指定的商业用途； 
			<br />
			3、甲乙双方根据《中华人民共和国合同法》等相关法律、法规，经友好协商，就购买使用服务事宜，达成如下协议： 
			<br />
			第一条服务方式 
			<br />
			1.1服务方式。甲方按照乙方在本合同中指定的用途向乙方提供云计算能力（以下简称“产品”），以满足乙方的商业需求。双方的合作为线下合作，但甲方会为乙方提供可通过网络访问的管理平台，以利于乙方管理和知晓其产品使用情况。乙方确认，即使乙方通过网络了解到甲方的服务、产品或本协议，乙方仍需通过线下方式联系甲方并在线下与甲方达成合作，甲方不通过线上网络平台的方式向客户售卖服务或产品。 
			<br />
			1.2产品用途。乙方指定甲方将其购买的产品用于为比特币的运行提供协同哈希计算。 
			<br />
			第二条产品内容 
			<br />
			2.1购买数量。甲方产品的计算单位为“T”，使用周期为终身合约。乙方确认，其根据本合同本次购买的甲方产品数为【】T。 
			<br />
			2.2产品使用期。乙方购买的产品使用期自2018年【07】月【20】日00:00起至终身乙方未能在使用期开始之前付款的，使用期的起止日期相应顺延，或由甲乙双方另行书面确认。 
			<br />
			2.3产品消耗。乙方理解甲方的产品为消耗性产品，产品价值随着使用周期的消耗而按比例降低，在使用周期到期后该产品即消耗完毕。 
			第三条产品费用 
			<br />
			
			3.1计费方式。双方同意，为了降低乙方购买成本，甲方提供的服务以首付款与日付款结合的方式计价收费。双方在此特别确认，乙方在支付完成首付款后，还需每日支付日付款，以保证对甲方产品的正常使用。 
			<br />
			3.2首付款金额。甲方每T产品的首付款单价为【】元/T（以下简称“首付款单价”）。乙方需为其购买的产品支付共计人民币【】元（大写：人民币【】元整）的首付款（计算公式为：总首付款=产品数×首付款单价）。 
			<br />
			3.3优惠活动：本协议约定，乙方每购买1T的产品，甲方额外赠送0.5T产品给乙方，赠送的产品首付款全额免除，日付款金额需要从收益中扣除。 
			<br />
			3.4日付款金额。乙方每日需为其购买的产品每日支付共计人民币【】元（大写：人民币【】元整）的日付款。日付款的计算公式如下： 
			日付款金额 = （服务单价×单位产品小时功耗×24h×产品数量）+管理费。  <br />
			本协议项下的服务单价为 0.55 元/Kw·h，单位产品小时功耗为 0.131 Kw/T，管理费为乙方每日因参与协同哈希计算获得的比特币将奖励的10%。
			<br />
			3.5价格波动。乙方理解甲方产品的价格随着技术改进、运营成本等多方面原因会有波动，甲方不保证产品未来的价格低于销售给乙方时的价格，乙方不得因甲方产品价格波动为理由向甲方提出任何形式的主张，包括但不限于任何形式的补偿、退款或优待。 
			<br />
			3.6价格调整。乙方应尽力保证在乙方使用产品的期限内的日付款服务单价不变。但如应甲方不可控制的原因，导致甲方成本上升20%以上或利润下降20%以上的，甲方保留调整服务单价的权利。但甲方正式调整服务单价之前应书面告知乙方，乙方如不接受该调整，则有权在一周之内书面告知甲方，并终止本协议。乙方选择终止本协议的，甲方按照乙方购买产品的剩余价值回购产品。 
			第四条费用支付 
			<br />
			4.1首付款支付方式。乙方应自本合同签署日起 3 个工作日内，将首付款金额一次性全额支付至甲方收款账户。乙为在过合同签署日后15个工作日内向甲方支付首付款的，甲方有权解除本协议。<br />
			4.2日付款支付方式。双方经协商后一致同意，乙方可以将日付款金额折算成比特币，使用比特币支付其需要支付给甲方的日付款。乙方授权甲方每日自动从乙方利用甲方产品从事比特币协同哈希计算所获得的比特币中自行扣除日付款经折算所对应的比特币。具体折算方式见比特币折算方式。 <br />
			4.3比特币折算方式。双方按北京时间每日00:00比特币交易平台www.bitfinex.com的比特币价格换算成人民币，计算出乙方应支付给甲方的比特币数量。如果前述网站无法正常运行或价格严重偏离市场行情的，甲方有权调整参考网站为更适用、更客观的网站，但应在甲方网站上恰当位置公告或通过站内信的方式通知乙方。 <br />
			4.4甲方收款账户信息。  <br />甲方收款账户信息如下： <br />
			户名：深圳射手座信息技术有限公司 <br />
			账号：8110301012900305902 <br />
			开户行：中信银行深圳三诺大厦支行 
			第五条管理平台 <br />
			5.1平台提供。为了便于乙方使用、管理其购买的甲方产品，甲方将免费为乙方提供网络管理平台。 <br />
			5.2平台服务。甲方提供的管理平台包含以下功能： <br />
			1）供乙方管理其购买的产品，查询其购买的产品的信息、使用状态； <br />
			2）供乙方管理、查询其利用产品进行比特币协同哈希运算所获取的比特币奖励； <br />
			3）供乙方查询其获得的比特币奖励通过管理平台进行的使用、提取记录；<br /> 
			4）供甲方公示甲方的服务协议、服务通知，以及包括但不限于比特币折算方式在内的各类服务信息和动态； <br />
			5）供甲方与乙方进行与产品相关的沟通； <br />
			6）其他应当或可以通过管理平台进行的行为。 <br />
			5.3比特币奖励说明。乙方利用甲方服务进行比特币协同哈希运算的过程中将获得一定数量的比特币奖励，该奖励减去日付款金额后的剩余部分将计入乙方在甲方平台的账户中。由于乙方是通过与其他客户协同的方式进行比特币哈希运算，故乙方获得的比特币奖励将根据乙方所购买的产品数量、当天全网络计算难度和成本费用计算。由于技术、结算、节假日及其他特殊原因，乙方的比特币奖励到账时间可能有所延迟，乙方对此表示知晓和认可。<br /> 
			第六条甲方的权利义务 <br />
			6.1按约服务。甲方应按照本协议的约定为乙方提供服务。 <br />
			6.2依法服务。甲方为乙方提供服务时应遵守国家法律法规、部门规章及各种其他规范性法律文件的规定。如甲方发现乙方利用甲方产品进行违法行为，甲方有权根据情况采取相应的处理措施，包括但不限于立即终止服务、中止服务等。 <br />
			6.3服务中断。甲方应尽力减少非源于乙方的服务中断，但因乙方原因和/或不可抗力以及非甲方控制范围之内的事项除外。乙方理解并认可，甲方在必要时将会服务进行升级改造，在升级改造期间可能会造成短暂的服务中断，相应的服务中断每月不超过10小时的，乙方不予追究甲方的责任。 <br />
			6.4中止服务。当乙方某日获得的比特币奖励以及乙方账户内的比特币余量不足以支付其日付费金额时，甲方有权中止乙方对产品的使用，直至乙方可获得的比特币奖励或其账户内比特币余量足以支付日付费余额且乙方主动申请重启服务时为止。甲方中止服务不会导致乙方产品使用期的截止日期延长。 <br />
			第七条乙方的权利义务 <br />
			7.1按约使用。乙方应按照本协议的约定使用甲方提供的服务。  <br />
			7.2优惠的处理。乙方完全理解其购买产品时所享受的各类优惠、折扣、赠品、活动为甲方在正常价格之外的一次性特别优惠，该优惠不可在甲方回购产品或本协议终止、解除时导致甲方为该优惠支付任何费用。  <br />
			7.3依法使用。乙方承诺其在使用甲方提供的产品时应遵守国家法律法规、部门规章及各种其他规范性法律文件的规定，其为甲方指定的产品使用用途不应违反国家法律规定，否则相关责任应由乙方承担。  <br />
			7.4妥善保管。乙方应对其管理平台的账号、密码的完整性和保密性负责。因乙方保密不当致使上述账号、密码等丢失或泄漏所引起的一切损失和后果均由乙方自行承担。  <br />
			7.5瑕疵谅解。乙方了解甲方无法保证其所提供的服务毫无瑕疵，但甲方承诺不断提升服务质量及服务水平。所以乙方同意：即使甲方提供的服务存在瑕疵，但上述瑕疵是当时行业技术水平、外部环境所无法避免的，其将不被视为甲方违约。乙方同意与甲方一同合作解决上述瑕疵问题。 <br /> 
			第八条保密条款  <br />
			8.1除双方另有约定以外，任何一方未经另一方同意，均不得向第三方披露本合同的存在以及本合同的任何内容、双方的合作形式以及在服务过程中一方提供给另一方的非公开信息。  <br />
			8.2双方均应对在履行本合同过程中所知悉的对方提供的任何信息、资料（即“保密信息”）承担保密义务，未经另一方的书面同意，均不得向第三方披露，也不得将保密信息用于本合同项下所涉合作事项之外的其他任何目的，否则违约方应承担由此所产生的一切损失。但在如下情形下，接受信息、资料的一方可披露其在履行本合同过程中所知悉的信息、资料：  <br />
			a)已为公众所知的该等信息；  <br />
			b)在任何诉讼、仲裁或其他法律程序中需要披露的信息；  <br />
			c)法律要求披露的信息；  <br />
			d)依照其上市地证券交易所的上市交易规则需要披露的信息；  <br />
			e)任何有管辖权的司法、行政机关要求披露的信息；  <br />
			f)需要向其董事、管理人员、员工（包括外聘人员）、代理人或专业顾问披露的信息，前提是被披露方已经承诺遵守本条规定的保密义务； <br /> 
			g)另一方书面同意披露的信息。  <br />
			8.3本协议双方明确认可保密信息是双方各自的重要资产，本协议双方同意尽最大的努力保护上述保密资料等不被披露。一旦发现有上述保密资料泄露事件，双方应合作采取一切合理措施避免或者减轻损害后果的产生。  <br />
			8.4本条款不因本协议的终止而失效。  <br />
			第九条知识产权  <br />
			9.1甲方在本协议项下向乙方提供的任何资料、技术或技术支持、软件、服务等的知识产权均属于甲方或其合法权利人所有；除甲方或合法权利人明示同意外，乙方无权复制、传播、转让、许可或提供他人使用上述知识成果，否则应承担相应的责任。  <br />
			9.2乙方不因与甲方签署本协议并获得甲方的产品或服务而获得向任何第三方授权甲方知识产权的权利。  <br />
			9.3如果任何第三方对甲方服务的知识产权归属提出质疑或投诉，乙方应及时告知甲方，甲方将进行处理。  <br />
			第十条服务终止  <br />
			10.1付费不足的终止。当乙方连续10日获得的比特币奖励不足以支付其日付费金额时，甲方有权终止乙方对产品的使用，除非乙方坚持继续服务且按日足额支付其日付费金额。甲方终止服务的，甲方有权按照乙方产品剩余价值的五折回购产品。 
			10.2客观情况下的终止。乙方理解并认可，因技术、经营策略或国家重政策等方面可能发生重大变化，甲方不保证永久的提供产品或服务，或可能变更所提供的产品或服务的形式、规格或其他方面。在甲方因前述情况的重大变化终止产品或服务前，将尽最大努力且提前以网站公告、站内信、邮件或短信等一种或多种方式进行事先通知。如终止提供该种服务的，甲方的提前通知将不短于15天，并且应妥善处理后续事宜，包括但不限于将乙方产品的剩余价值退还给乙方。 
			10.3协商终止。经甲乙双方协商一致的，本协议可以提前终止。  <br />
			10.4违约终止。乙方严重违反本协议的，甲方有权提前终止产品或服务。  <br />
			第十一条违约责任  <br />
			11.1任何一方违反本合同项下的义务或者保证的，均构成违约，除本合同另有约定外，守约方有权要求违约方采取补救措施，继续履行合同和赔偿给守约方造成的损失。  <br />
			11.2在合同履行期间，乙方应按日结清日付款，或保证其账户内有足够的比特币以供甲方扣除日付款。乙方未能及时支付日付款的，甲方有权从乙方获得的比特币奖励中先行扣除乙方已欠的日付款，并有权视情况对乙方采取停止产品运行或服务的措施。乙方需要缴纳欠费总额每日0.1%的滞纳金，结清费用后第二天甲方为乙方恢复产品运行或服务。如乙方逾期10天仍未结清费用，则视为乙方放弃产品和服务，甲方有权终止乙方的产品或服务。甲方依据本条中断乙方的产品或服务的，乙方的产品使用期截止日期不因此延长；甲方依据本条终止乙方的产品或服务的，乙方产品使用期视为立即到期。 
			11.3若乙方需提前终止合同，需要提前15个工作日向甲方提出书面申请，甲方同意的，可以乙方产品的剩余价值的五折或双方一致同意的其他折扣回购乙方产品。  <br />
			11.4若乙方将产品或服务部分或全部转让，受让方需与甲方签订合同并无条件接受双方本协议的约定。  <br />
			11.5本合同项下有关一方违约时守约方的各项权利均是独立且可累积行使的，守约方对本合同项下某一项权利的行使，在任何情况下均不可被视为其对本合同项下其他权利之放弃。  <br />
			11.6乙方理解，鉴于比特币哈希计算的特殊性，除不可抗力和意外事件外，下述情况亦不属于甲方违约：   <br />
			1）甲方配置、维护产品所对应的服务器，需要短时间中断服务；  <br />
			2）由于网络通路的阻塞造成产品或服务的速度下降或暂停；  <br />
			3）由于大面积停电等原因造成产品或服务的暂停。  <br />
			11.7如因甲方原因，造成产品或服务连续72小时不能正常使用的，乙方有权终止产品或服务，要求甲方按产品剩余价值回购产品，但非甲方控制之内的原因引起的除外。   <br />
			第十二条免责条款   <br />
			12.1乙方理解并同意，甲方仅为产品或服务的技术提供方，不对乙方使用产品或服务所能获得的收益做出任何承诺。甲方不对乙方使用或不能使用甲方产品或服务的工作或结果承担任何责任。   <br />
			  <br />12.2乙方同意在任何情况下，甲方因本协议而向乙方承担的任何责任或支付的任何赔偿的金额不应超过乙方向甲方支付的首付款和日付款之合。 
			第十三条不可抗力和意外事件   <br />
			13.1因不可抗力或者其他意外事件，使得本协议的履行不可能、不必要或者无意义的，遭受不可抗力、意外事件的一方不承担责任。   <br />
			  <br />13.2不可抗力、意外事件是指不能预见、不能克服并不能避免且对一方或双方当事人造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行等以及社会事件如战争、动乱、政府行为、电信主干线路中断、供电的停止、黑客、网路堵塞、电信部门技术调整和政府管制等。 
			  <br />1.3若在不可抗力事件发生之日起30日内合同仍无法履行的，双方亦无法达成一致意见的，则任何一方均有权终止本合同。本合同因此而终止的，双方互不承担违约责任。 
			第十四条法律适用及争议解决 
			  <br />14.1本合同适用中华人民共和国法律。 
			  <br />14.2所有因本合同或本合同的违反、中止或无效所引起的或与之有关的争议、争论和索赔(“争议”)应由双方通过友好协商解决。如果双方协商不成，则双方有权将争议提交本合同甲方所在地人民法院诉讼解决。在诉讼过程中，除本合同中进行争议的事项外，双方应继续执行本合同。 
			  <br />第十五条其它约定事项 
			  <br />15.1本协议约定的价格和条款仅适用于乙方本次向甲方购买的特定数量的产品和服务。协议到期不得自动续签，需要双方根据届时的产品和服务的形式和价格重新签署新的协议。 
			  <br />15.2甲方有权通过提前30天在其官网上发布公告、发站内通知或邮件通知等方式将本协议的权利义务全部或者部分转移给甲方关联公司，同时关联公司不会实质性降低乙方可获得服务的质量，否则甲方与关联公司将向乙方承担连带责任。 
			  <br />15.3本协议项下之保密条款、知识产权条款、法律适用及争议解决条款等内容，不因本协议的终止而失效。 
			  <br />15.4本合同未尽事宜，经双方协商一致可以订立书面补充合同。本合同的附件和补充合同均为本合同不可分割的组成部分，与本合同具有同等的法律效力。 
			  <br />15.5本合同自双方签字或盖章之日起生效。双方签约日期不一致的，以签署在后的日期为生效日期。 
			  <br />15.6本合同项下附件均为本合同一部分，与本合同具有同等法律效力。 
			  <br />15.7本合同一式贰份，甲方执壹份，乙方执壹份，具有同等法律效力。 
			  <br />（以下无正文，为签字页） 
			  <br />(本页无正文，为深圳射手座信息技术有限公司与【填入乙方公司名称】之《云算力服务协议》签署页) 
			  <br />甲方：深圳射手座信息技术有限公司 
			  <br />法定代表人(或授权代表)： 
			  <br />签订日期： 年 月 日
			  <br />乙方：【填入乙方公司名称】 
			  <br />法定代表人(或授权代表)： 
			  <br />签订日期：&nbsp;&nbsp;&nbsp;&nbsp; 年 &nbsp;&nbsp;&nbsp;&nbsp;月 &nbsp;&nbsp;&nbsp;&nbsp;日
		</div>	
	</div>
</template>

<script>
</script>

<style scoped>
.agreement {
	width: 100%;
	height:auto;
	background:#ffffff;
	padding-top: 75px;
}
.w {
	width: 750px;
	height: auto;
	line-height: 30px;
	padding-bottom: 25px;
	margin: 0px auto;
	overflow: hidden;
}
.title {
	text-align: center;
	font-size: 19px;
	font-weight: 600;
}

</style>